app/views/users/index.html.erb


<h3>There are currently <%= pluralize(@users.length, "user") %></h3>
---
SELECT "users".* FROM "users"