app/controllers/grade_scales_controller.rb

  def index
    @grade_scales = GradeScale.all
---
SELECT "grade_scales".* FROM "grade_scales"