app/controllers/users_controller.rb

	def index
		# This option should only be usable by the administrators
		if not @current_user.is_administrator?
			redirect_to root_path
			return
		end

		@users = User.all
---
SELECT "users".* FROM "users"

	def show
		@user = @current_user

		if @user.is_administrator? and params.has_key?(:id)
			@user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]

	def create
		@user = User.new(params[:user])

		respond_to do |format|
			if @user.save
---
INSERT INTO "users" ("created_at", "email", "first_name", "last_name", "middle_name", "password", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?)